#include<stdio.h>
/**
 * 运算符
 *   算数(运算符)
 *   关系
 *   逻辑
 *   位
 *   赋值
 *   杂项
 * 
 * 位运算符
 *   p   q   p&q(与) p|q(或) p^q(异或)
 *   0   0   0       0       0
 *   0   1   0       1       1
 *   1   0   0       1       1
 *   1   1   1       1       0
 *   取反运算符 ~
 *     例1:
 *       A = 0011 1100
 *       ~A = 1100 0011
 *     例2:
 *       ~1 = -2
 *       1 = 0000 0001
 *       ~1 = 1111 1110
 *       ~1[反] = 1000 0001
 *       ~1[补] = 1000 0010 = -2
 *     例3:
 *       ~0 = -1
 *       0 = 0000 0000
 *       ~0 = 1111 1111
 *       ~0[反] = 1000 0000
 *       ~0[补] = 1000 0001 = -1
 *   二进制左移运算符 << (右补0)
 *     例1:
 *       A = 0011 1100
 *       a << 2 = 1111 0000 = 240
 *   二进制右移运算符 >>
 *     正数左补0,负数左补1,负数需要转换成补码再进行左移或右移操作
 *     例:
 *     -1
 *     [-1]原 = 1000 0001
 *     [-1]反 = 1111 1110
 *     [-1]补 = 1111 1111
 *     左移1位变为 1111 1111 ,与原补码等同,故-1左移1位后仍为-1 
 *   逻辑与运算符 &&
 *   逻辑或运算符 ||
 *   逻辑非运算符 !
 *   杂项运算符
 *     返回变量大小 sizeof()
 *     返回变量的地址 &
 *     指向一个变量 *
 *     条件表达式 ?:
 */
int main() {
    int a = -1;
    int b = 0;
    int c = 1;
    int d = 0X2;
    int e = -1;
    int* f;
    float g = 1;
    printf("~a=%d\n", ~a);
    printf("~b=%d\n", ~b);
    printf("~c=%d\n", ~c);
    printf("d<<1=%d\n", d<<1);
    printf("d>>1=%d\n", d>>1);
    printf("e<<1=%d\n", e<<1);
    printf("e>>1=%d\n", e>>1);
    f = &d;
    printf("f=%d\n",*f);
    printf("g的大小:%lu\n", sizeof(g));

}